{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[3, 3], [3, 3]], "trainable": false, "name": "padding_conv1", "data_format": "channels_last"}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "padding_conv1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [7, 7]}, "inbound_nodes": [[["padding_conv1", 0, 0, {}]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_conv1", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "conv1_relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "conv1_relu"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "pool1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2a_branch2a_relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "res2a_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding2a_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res2a_branch2a_relu", 0, 0, {}]]], "name": "padding2a_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding2a_branch2b", 0, 0, {}]]], "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2a_branch2b_relu"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "res2a_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res2a_branch2b_relu", 0, 0, {}]]], "name": "res2a_branch2c"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch1", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1"}, {"class_name": "Add", "config": {"trainable": false, "name": "res2a"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "res2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2a_relu"}, "inbound_nodes": [[["res2a", 0, 0, {}]]], "name": "res2a_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2b_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res2a_relu", 0, 0, {}]]], "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2b_branch2a_relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "res2b_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding2b_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res2b_branch2a_relu", 0, 0, {}]]], "name": "padding2b_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2b_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding2b_branch2b", 0, 0, {}]]], "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2b_branch2b_relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "res2b_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2b_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res2b_branch2b_relu", 0, 0, {}]]], "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "name": "res2b"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["res2a_relu", 0, 0, {}]]], "name": "res2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2b_relu"}, "inbound_nodes": [[["res2b", 0, 0, {}]]], "name": "res2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2c_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res2b_relu", 0, 0, {}]]], "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2c_branch2a_relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "res2c_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding2c_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res2c_branch2a_relu", 0, 0, {}]]], "name": "padding2c_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2c_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding2c_branch2b", 0, 0, {}]]], "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2c_branch2b_relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "res2c_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2c_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res2c_branch2b_relu", 0, 0, {}]]], "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "name": "res2c"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["res2b_relu", 0, 0, {}]]], "name": "res2c"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res2c_relu"}, "inbound_nodes": [[["res2c", 0, 0, {}]]], "name": "res2c_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res2c_relu", 0, 0, {}]]], "name": "res3a_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3a_branch2a_relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "res3a_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding3a_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res3a_branch2a_relu", 0, 0, {}]]], "name": "padding3a_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding3a_branch2b", 0, 0, {}]]], "name": "res3a_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3a_branch2b_relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "res3a_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3a_branch2b_relu", 0, 0, {}]]], "name": "res3a_branch2c"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res2c_relu", 0, 0, {}]]], "name": "res3a_branch1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch1", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1"}, {"class_name": "Add", "config": {"trainable": false, "name": "res3a"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "res3a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3a_relu"}, "inbound_nodes": [[["res3a", 0, 0, {}]]], "name": "res3a_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3b_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3a_relu", 0, 0, {}]]], "name": "res3b_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3b_branch2a_relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "res3b_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding3b_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res3b_branch2a_relu", 0, 0, {}]]], "name": "padding3b_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3b_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding3b_branch2b", 0, 0, {}]]], "name": "res3b_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3b_branch2b_relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "res3b_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3b_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3b_branch2b_relu", 0, 0, {}]]], "name": "res3b_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "name": "res3b"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["res3a_relu", 0, 0, {}]]], "name": "res3b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3b_relu"}, "inbound_nodes": [[["res3b", 0, 0, {}]]], "name": "res3b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3c_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3b_relu", 0, 0, {}]]], "name": "res3c_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3c_branch2a_relu"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "res3c_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding3c_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res3c_branch2a_relu", 0, 0, {}]]], "name": "padding3c_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3c_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding3c_branch2b", 0, 0, {}]]], "name": "res3c_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3c_branch2b_relu"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "res3c_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3c_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3c_branch2b_relu", 0, 0, {}]]], "name": "res3c_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "name": "res3c"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["res3b_relu", 0, 0, {}]]], "name": "res3c"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3c_relu"}, "inbound_nodes": [[["res3c", 0, 0, {}]]], "name": "res3c_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3d_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3c_relu", 0, 0, {}]]], "name": "res3d_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3d_branch2a_relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "res3d_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding3d_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res3d_branch2a_relu", 0, 0, {}]]], "name": "padding3d_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3d_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding3d_branch2b", 0, 0, {}]]], "name": "res3d_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3d_branch2b_relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "res3d_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3d_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3d_branch2b_relu", 0, 0, {}]]], "name": "res3d_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "name": "res3d"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["res3c_relu", 0, 0, {}]]], "name": "res3d"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res3d_relu"}, "inbound_nodes": [[["res3d", 0, 0, {}]]], "name": "res3d_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3d_relu", 0, 0, {}]]], "name": "res4a_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res4a_branch2a_relu"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "res4a_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding4a_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res4a_branch2a_relu", 0, 0, {}]]], "name": "padding4a_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding4a_branch2b", 0, 0, {}]]], "name": "res4a_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res4a_branch2b_relu"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "res4a_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res4a_branch2b_relu", 0, 0, {}]]], "name": "res4a_branch2c"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res3d_relu", 0, 0, {}]]], "name": "res4a_branch1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch1", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1"}, {"class_name": "Add", "config": {"trainable": false, "name": "res4a"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "res4a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res4a_relu"}, "inbound_nodes": [[["res4a", 0, 0, {}]]], "name": "res4a_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4b_branch2a", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res4a_relu", 0, 0, {}]]], "name": "res4b_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2a", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res4b_branch2a_relu"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "res4b_branch2a_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "padding4b_branch2b", "data_format": "channels_last"}, "inbound_nodes": [[["res4b_branch2a_relu", 0, 0, {}]]], "name": "padding4b_branch2b"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4b_branch2b", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["padding4b_branch2b", 0, 0, {}]]], "name": "res4b_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2b", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "name": "bn4b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res4b_branch2b_relu"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "name": "res4b_branch2b_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4b_branch2c", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["res4b_branch2b_relu", 0, 0, {}]]], "name": "res4b_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2c", "epsilon": 1e-05, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "freeze": true, "scale": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "name": "bn4b_branch2c"}, {"class_name": "Add", "config": {"trainable": false, "name": "res4b"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["res4a_relu", 0, 0, {}]]], "name": "res4b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "res4b_relu"}, "inbound_nodes": [[["res4b", 0, 0, {}]]], "name": "res4b_relu"}, {"class_name": "Conv2D", "config": 